[
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "WagALotBowWow",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "December 23, 2024",
    "usage_duration": "",
    "review_text": "Love PrintMelon, they do a nice job with printing and always place it nicely if I'm a little off on centering. Very good customer support. I have recommended them to others that need a POD place.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "PenfieldStuff",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 26, 2024",
    "usage_duration": "",
    "review_text": "I started a new store and needed a lot of different items for sports teams and fans including hoodies, crewnecks, dry fit, long sleeve, short sleeve, different types of hats like twill or trucker plus men, women, youth and anything else the teams ask for on a daily basis!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "SOCAL REDS FC - MERCHANDISE",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "October 7, 2024",
    "usage_duration": "",
    "review_text": "This print on demand app has everything I need. Variety of the Kids shirts are uber good, helps me to sell lots of birthday related shirts. Customer service is very friendly, I had several issues with the UI and they helped me right away. I recently added hats and athletic wear apparel. I hope those will sell too. Highly recommend this app.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Make It Your Own Edit",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 16, 2024",
    "usage_duration": "",
    "review_text": "This Print on Demand company is great to deal with. Their customer service is very fast in solving the issues, I tried some basketball jerseys with name and numbers on back and school logo on front, it arrived within less than a week. The products they carry is way too much for me to handle, I can literally find whatever type of apparel I'm looking for on this site. UI could be more friendly but ...",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Macguire Shoes",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 3, 2025",
    "usage_duration": "",
    "review_text": "This POD is user-friendly, reliable, and packed with features that make managing a print-on-demand business effortless. The quality of the products and prints has been consistently excellent, and the app’s integration with e-commerce platforms is a huge bonus. I highly recommend it to anyone looking to start or scale a print-on-demand business.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": " Hiut Denim Co.",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 2, 2025",
    "usage_duration": "",
    "review_text": "This app offers an impressive variety of products to choose from—t-shirts, hoodies, mugs, aprons, hats, jerseys,tote bags, and more. This makes it easy to expand my product line and cater to different customer preferences. The ability to see how my designs look on each product before ordering is a huge plus.",
    "developer_response": "Hello, Thanks for your review. We are very glad you are happy with our services. Its our pleasure to be your print on demand fulfillment partner.",
    "developer_response_date": "May 26, 2025"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Plant Based Hair Care for Natural Hair",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited November 18, 2024",
    "usage_duration": "",
    "review_text": "Initially, I thought my order had been ignored. I did not realize that I needed to add my CC information.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Elder Statesman",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 26, 2025",
    "usage_duration": "",
    "review_text": "I’ve tried several print-on-demand apps, but Print Melon stands out as the best! The integration with Shopify is seamless, making it super easy to upload designs and sync products. Their product selection is great, with high-quality apparel, hats, and mugs that my customers love.",
    "developer_response": "Hello, Thanks for your review. We are very glad you are happy with our services. Its our pleasure to be your print on demand fulfillment partner.",
    "developer_response_date": "May 26, 2025"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Goodfair",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "February 24, 2025",
    "usage_duration": "",
    "review_text": "This Print on demand app is incredibly intuitive and easy to navigate. Uploading designs, customizing products, and placing orders is straightforward, even for someone who isn’t tech-savvy.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Going the Distance Stores (A Self Care Company)",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 24, 2024",
    "usage_duration": "",
    "review_text": "Print Melon is an amazing app and the Print Melon team provides phenomenal and prompt service. Our store loves Print Melon and will continue to use them. Thank you!",
    "developer_response": "We appreciate your business, thanks for being a valued Print on Demand partner :)",
    "developer_response_date": "April 2, 2024"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Pop Sockets",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 19, 2025",
    "usage_duration": "",
    "review_text": "Print Melon has made running my online store so much easier. The product variety is great, and the print quality is outstanding. I love how smoothly it syncs with Shopify, and the automated order processing saves me so much time. Customer service is also fantastic—they’re quick to respond and very helpful. Definitely a must-have for any print-on-demand business!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "FPVCycle",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "Edited May 25, 2022",
    "usage_duration": "",
    "review_text": "We sell electronics so our demand for t-shirts is occasional at best. Recently one of our out-of-stock products was mysteriously selling as of a sudden. After investigation, it was Print Melon that modified our electronics inventory and caused a firestorm for us. We had to issue multiple refunds, apologize to many customers, spent hours in customer service, and unfortunately lost a lot of trust ...",
    "developer_response": "Hello, Thanks for your review. Just to be clear, we fixed the bug on your website so that it would never happen again. You gave us the access after having this inventory ...",
    "developer_response_date": "May 12, 2022"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "URevolution",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "Edited April 5, 2022",
    "usage_duration": "",
    "review_text": "We would consider using Print Melon more but they have the absolute worst design interface of any of the POD apps we use. In addition to the horrific interface, there is no way to filter by size, and even when a product description lists sizes, when you start the design process you discover the available sizes don't match the description. Given the POD competition surely they would redesign their ...",
    "developer_response": "Hi, Thanks for your review. As stated on our email, the blank photos are directly taken from the apparel brands, we can't modify them. We did ask LAT to update their photos, ...",
    "developer_response_date": "May 7, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "five + crew",
    "reviewer_location": "",
    "rating": 3,
    "review_date": "April 18, 2021",
    "usage_duration": "",
    "review_text": "Overall, I would give this app a B-, maybe C+. Cons: I have had an order take 2 days to get out, and I have had one that took over 2 weeks to get out because of product availability. On darker colors they either do sublimation or screen printing (not 100% sure of the difference) and on lighter tees they do DTG printing. I have also had brand of shirts switched out without my knowledge and was ...",
    "developer_response": "Thanks for your review and comments, they are very important to us. After checking your orders, we were not sure which order took 2 weeks to ship, we always contact our users ...",
    "developer_response_date": "April 19, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "The Outrage",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "February 16, 2025",
    "usage_duration": "",
    "review_text": "The pricing is competitive, especially for the quality you receive. They offer transparent pricing with no hidden fees, and the ability to order samples. For anyone starting a business, this is a great way to test products before committing to larger orders. I couldn’t be happier with my experience with Print Melon. They’ve made it easy for me to bring my creative ideas to life, and the quality ...",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Wagner Skis",
    "reviewer_location": "",
    "rating": 2,
    "review_date": "August 3, 2021",
    "usage_duration": "",
    "review_text": "Never got the app fully up and running because all the samples came back un-aligned. Giving 2 stars because the support team was great and issued a refund.",
    "developer_response": "Thanks for your review. We apologize for printing your samples misaligned. Im glad you were happy with the customer service.",
    "developer_response_date": "August 5, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Dark Sentinel",
    "reviewer_location": "",
    "rating": 2,
    "review_date": "July 5, 2019",
    "usage_duration": "",
    "review_text": "I want to like this app as the products are a bit different to what's available from most POD suppliers. The problem is international shipping costs start at $15 to ship a t-shirt. All other products on our store (from other suppliers) we can sell everywhere - we couldn't do that with these at this price so have had to remove the app. If they sort out better shipping arrangements, it would be ...",
    "developer_response": "Thanks for your review, we are always on the look for new trends and new type of POD products.",
    "developer_response_date": "August 7, 2019"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Ripped and Restored",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "January 30, 2021",
    "usage_duration": "",
    "review_text": "This app is awesome. Love all of my products from here. The process is so easy and seamless. This is the best one I've found so far.",
    "developer_response": "Thanks for your review and support. We are very lucky to have you as our print on demand partner.",
    "developer_response_date": "January 31, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Bizaanide'ewin ",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "May 18, 2023",
    "usage_duration": "",
    "review_text": "Shipping details never get sent over, Integration glitches and people only get some of their items, \"out of stock\" emails NEVER come with options to substitute with and wastes a TON of time. The products are just okay, but the shipping and UX is awful.",
    "developer_response": "We apologize for this inconvenience. These are all fixed now, and we appreciate you for still using our POD app.",
    "developer_response_date": "January 22, 2024"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "My.BPM",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "December 9, 2020",
    "usage_duration": "",
    "review_text": "Print Melon is one of the best POD providers on Shopify. I've personally tried so many of the providers. They have been the most constant and provide the highest quality I've seen.",
    "developer_response": "Thanks for your review. We appreciate your business and its our pleasure to be your fulfillment partner.",
    "developer_response_date": "December 9, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Hashtag the Things!",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "July 12, 2021",
    "usage_duration": "",
    "review_text": "Requirement to run all payments of any kind through PayPal is a short-sighted way to do business. And is also a showstopper. App deleted. Will not do business with anyone requiring PayPal.",
    "developer_response": "Thanks for your review. We added credit card option on our app. You can add your credit card instead of a paypal. Whichever you prefer.",
    "developer_response_date": "April 20, 2022"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "US Top Fashion",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "January 27, 2021",
    "usage_duration": "",
    "review_text": "Excellent quality, Excellent customer support The customer support is very helpful. I can turn to them with any question or a problem I have and they were always prepered to help and resolve the issue. They also have a great variaty of products and very easy system of launching the products to the store. I love them!",
    "developer_response": "Thanks for your awesome review. We appreciate your business and we are so lucky to have you as our valued fulfillment partner.",
    "developer_response_date": "January 27, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Mature Content Apparel",
    "reviewer_location": "",
    "rating": 2,
    "review_date": "January 11, 2021",
    "usage_duration": "",
    "review_text": "This app has a decent selection with okay prices. Prices are little above average and it typically takes about 3 - 5 to ship. However, my only issue with them is their packaging. They stuff t-shirt(s) the white plastic envelope packaging. The t-shirt no folded nicely nor does it have a clear plastic package like other companies. It just looks bad. I'd pay a little more for nice packaging and ...",
    "developer_response": "Hello, Thanks for your review. Unfortunately we don't put each shirt inside a clear bag at the moment. We will be offering that service this year. The shirts are nicely ...",
    "developer_response_date": "January 11, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Birds In The Air | WorldWideWob",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "January 11, 2024",
    "usage_duration": "",
    "review_text": "I ordered sample products from Print Melon and received them in less than a week, super fast shipping as well as packaging. When they arrived, they were packed individually inside a clear bag, the prints look super neat, app is very easy to navigate and user friendly. I'm so happy to find this print on demand app.",
    "developer_response": "We appreciate your business, thanks for using our app. its our pleasure to be your Print on demand partner.",
    "developer_response_date": "January 22, 2024"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Wears The Mountain",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited November 18, 2020",
    "usage_duration": "",
    "review_text": "UPDATE: Nothing but 5 stars! There were a few growing pains, but nothing we couldn't figure out. The ownership has reached out multiple times to make sure I'm on the right path. If you're a small business looking to partner with a caring company, I strongly suggest!! Posted 10/13/2020: Excellent quality and turn around time, but I'm REALLY struggling with Print Melon's Customer Service at the ...",
    "developer_response": "Hello, Thanks for your review, we have responded all of your requests within same day, matter of fact in couple hours. As one of the orders being charged for international ...",
    "developer_response_date": "October 13, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Elle Elle 1980",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 20, 2022",
    "usage_duration": "",
    "review_text": "I sell mostly t-shirts and have been wanting more color and brand choices. Not only did I find that with Print Melon, but they pretty much make the whole process stress free! I'm always worried about how big or small I should make my designs and just wear to place my designs on products. I don't have to worry that anymore because Print Melon makes sure it's all just right for me. Plus, their ...",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "TheCozyApparel2",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 29, 2020",
    "usage_duration": "",
    "review_text": "The print quality is amazing and not a single issue so far. Support team replies super fast too. 10/10",
    "developer_response": "Thanks for your review, our job is to to make is sure you and your end buyer is fully satisfied with the order. We are lucky to be your fulfillment partner.",
    "developer_response_date": "July 29, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Meaningful Tees Shop",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited May 28, 2021",
    "usage_duration": "",
    "review_text": "I have been using Print Melon for about 6 weeks now and I am absolutely THRILLED with them for a number of reasons. First let me say that I have tried ALL of the major POD companies. I am an experienced Graphic Designer and I am VERY picky about every aspect of my business. Here are the reasons I love Print Melon: 1) Excellent White Ink Coverage on Dark Tshirts 2) Excellent Black Ink Coverage on ...",
    "developer_response": "Thanks for your awesome review, we are very lucky to be your fulfillment partner.",
    "developer_response_date": "May 28, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Locker 55",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 25, 2020",
    "usage_duration": "",
    "review_text": "Print Melon has been great! My prints thus far have all come out exactly as I had hoped. Their customer service is stellar and super responsive. They have a great selection of products and shipping times have also been super fast. 100% recommend!",
    "developer_response": "Hello, Thank you very much for your great review and support. We will always try our best to make it sure you are very well taken care of.",
    "developer_response_date": "September 25, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "thisisyoursign",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 6, 2020",
    "usage_duration": "",
    "review_text": "I looked at a bunch of different options before finally deciding on Print Melon and I love them! Their communication is super fast and helpful, and you don't at all have a big corporation feel! 10/10 recommend!",
    "developer_response": "Thanks for your review. We appreciate your support, and we love communicating with our fulfillment partners.",
    "developer_response_date": "August 6, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Called to Edify Boutique",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "June 18, 2020",
    "usage_duration": "",
    "review_text": "I am currently testing out this app and it has been phenomenal! This shipping speed is amazing, the quality is exceptional, and their customer service is unmatched! I was with another company and have decided to switch over to this company. Thanks for being such an outstanding company that really cares about the needs of their customers.",
    "developer_response": "Thanks for your review. We are very lucky to be your fulfillment partner.",
    "developer_response_date": "June 18, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "The Movement Shop",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 31, 2020",
    "usage_duration": "",
    "review_text": "I have received samples from every single POD company in existence. I stumbled upon Print Melon and decided, why not try? I am so glad I did. I don't understand why this isn't more widely known with in Shopfiy communities! The Print is on par with heat pressed vinyl or screen print, the customer service is top notch, and the t-shirts I ordered as samples came out AMAZING.",
    "developer_response": "Thanks so much for your review. Its our pleasure to be your fulfillment partner.",
    "developer_response_date": "August 31, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Couples Apparel",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited October 22, 2018",
    "usage_duration": "",
    "review_text": "I have used several print on demand apps but Print Melon is much easier to use and they have plenty of different type of apparels. It literally takes seconds to create and publish a product to my Shopify store.App is super fast and the design studio is very user-friendly. The support is very responsive, I asked them a question and got a response within less than an hour. So far so good :) Highly ...",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Iron Savage Apparel",
    "reviewer_location": "",
    "rating": 4,
    "review_date": "Edited September 10, 2020",
    "usage_duration": "",
    "review_text": "Product selection looks decent, international shipping prices are high.",
    "developer_response": "Thanks for your review. We are very sorry that nobody has responded right away to your email. We received your email at 9.16pm Pacific Time ( 9 hours ago), and just responded ...",
    "developer_response_date": "September 10, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "NothinMerch",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "October 29, 2021",
    "usage_duration": "",
    "review_text": "app deleted spent hours making items just to see that everything is sold out update your inventory tracker. trash!! and what makes it worst is they have good items that you would want to try but how can you when everything is constantly not available",
    "developer_response": "Thanks for your review, to be clear, you are publishing a product, on your website inventory, that product is showing Zero quantity?? If thats the case, it sounds like ...",
    "developer_response_date": "October 29, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Jasmine + Marigold",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "October 22, 2018",
    "usage_duration": "",
    "review_text": "I love the clean and easy-to-use interface of Print Melon app. The prices of the garments are fair (the adult tees are less pricey than Printful!) and I like how many different styles are available. I ordered some sample products and I really appreciate the good print quality. I also emailed a question and their team got back to me within reason. Really excited to use this interface for my orders ...",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "22 Lions Bookstore",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "November 15, 2018",
    "usage_duration": "",
    "review_text": "How do you expect to work like this? The app has no quality. The products are cheap, but price is not all that matters. I'm deleting the app from my store.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Lucy yak",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 26, 2025",
    "usage_duration": "",
    "review_text": "Great app for anyone starting a POD business! Seamless Shopify integration means orders are processed automatically, and the design studio allows full creative control. Their customer support team is also amazing—super friendly and knowledgeable!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": " Irregular Choice",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 25, 2025",
    "usage_duration": "",
    "review_text": "This print on demand app has exceeded my expectations. The seamless integration with Shopify makes managing my store easy, and the design studio is user-friendly. Customer support is also excellent--they go above and beyond to help!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Encouraged Living",
    "reviewer_location": "",
    "rating": 2,
    "review_date": "May 3, 2024",
    "usage_duration": "",
    "review_text": "I gotta say, I'm quite disappointed with this product / service. It took 3 weeks for me to get the order and then when I did, the printing was an iron on. That will come off after several washes. On top of that, the printing is not what was expected. The printing was not the way it showed on the shop page online. The positive was that customer service was quite responsive and the product before ...",
    "developer_response": "Thanks for your review. We apologize for the prints not being as expected, you can always message us for replacements or refunds. As for the shipping, also stated on our ...",
    "developer_response_date": "May 7, 2024"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Skipper ",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 21, 2024",
    "usage_duration": "",
    "review_text": "A friend of mine referred this print on demand app to me, so fas I like it. Their UX is very user friendly, I like the design studio. Products are promising.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Molly Pistachio™",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 16, 2024",
    "usage_duration": "",
    "review_text": "Print melon is a game changer for my business they have exactly what im looking for and un matched customer service. I would highly recommend for your POD supplier :)))",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Gogi Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 8, 2024",
    "usage_duration": "",
    "review_text": "Thanks for helping me with my issue, you guys solved it within same day. Excellent service. I love this print on demand business!!",
    "developer_response": "Thanks for using our app!! We appreciate your business",
    "developer_response_date": "April 13, 2024"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "My Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 8, 2024",
    "usage_duration": "",
    "review_text": "Great service, this print on demand app has more than everything i need",
    "developer_response": "Thanks for your review, please always let us know if there is anything we can do to support your business",
    "developer_response_date": "April 13, 2024"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "My Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited April 5, 2024",
    "usage_duration": "",
    "review_text": "Customer service of this print on demand app is awesome, i had an issue uploading an image on of the sports pants, since the legs were side by side, it was hard to align the image, i sent them an email and problem solved same day. They even send me a video of how to fix it.",
    "developer_response": "Thanks for your review. We appreciate your business.",
    "developer_response_date": "April 13, 2024"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "MOBILE FIX",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "January 27, 2024",
    "usage_duration": "",
    "review_text": "\"Sleeve Prints and Variety is unbeatable\"",
    "developer_response": "We appreciate your review and support. Thanks for being a valued POD partner",
    "developer_response_date": "January 29, 2024"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Good Pets - We Donate 100% Of Every Sale To Animals",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "January 11, 2024",
    "usage_duration": "",
    "review_text": "I sent Print Melon an email and literally got a response within 20minutes, then ordered my samples, I didn't realize they also offer neck labels, I contacted them after receiving the products and they were so kind as to send out replacements with my neck label on them. Whenever I have a question, they respond within an hour and they do solve any problems/issues you may have. I will be placing ...",
    "developer_response": "Its our pleasure to be your Print on demand partner, we appreciate your business",
    "developer_response_date": "January 22, 2024"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "giftmeabreak",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "October 24, 2023",
    "usage_duration": "",
    "review_text": "Print Melon was the first POD company I used. I will tell you what I like about them....CUSTOMER SERVICE #1!!! They are quick to respond to emails which is so important to me especially if I have a problem. Their shipping times are very reasonable. I don't have much experience in the quality from different suppliers but I can tell you that the shirt I ordered for myself was very good quality and ...",
    "developer_response": "Thanks for your awesome feedback. We are thrilled to be your print on demand provider and partner",
    "developer_response_date": "January 22, 2024"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Invisible Trendsetter",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 19, 2022",
    "usage_duration": "",
    "review_text": "I actually love this print company! anytime I have concerns or questions they never hesistate to respond with a sense of urgency. They also stepped up the quality control! I have been using them for years and they get better every year! Best print company on Shopify!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "JaneseApparel",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "February 23, 2022",
    "usage_duration": "",
    "review_text": "Outstanding print quality and support. Have been using them from more than a year with zero issues 10/10.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "MyEZgo",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "Edited December 6, 2021",
    "usage_duration": "",
    "review_text": "Corporate PrintMelon doesn't answer your need for help right away. You have to fix everything yourself. I'll be going to another brand. Don't bother",
    "developer_response": "Hello, Your order are placed from different app, they are not our orders. You asked us to fulfill orders that we never received. We sent you screen shots of the details of ...",
    "developer_response_date": "December 6, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Cody Orlove",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "October 29, 2021",
    "usage_duration": "",
    "review_text": "We have been working with Print Melon for over a year and a half. They have successfully helped us streamline our dropshipping merch business. They have excellent customer service and troubleshoot our issues in 12 hours or less. Their print quality is top of the line for direct-to-garment printing. They offer custom labels, printing down the arm and pant legs. Their app makes choosing products, ...",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "alltheblessings",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "October 10, 2021",
    "usage_duration": "",
    "review_text": "Made my first sale today using Print Melon, I love the variety and quality of the products they have available. I love that I can add my business logo to my products and build my brand.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "SUNYA LAMP",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 30, 2021",
    "usage_duration": "",
    "review_text": "100 percent working. There are a lot of design that you can choose as well as you can upload your own design.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Activegearhub",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 30, 2021",
    "usage_duration": "",
    "review_text": "This app rocks. I love it so much. It is very good and friendly user. It also did not affect my website speed.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "JOYOUTFITS ",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 30, 2021",
    "usage_duration": "",
    "review_text": "This app is so Lit. The best thing I love is that you can create your design. I already submitted my original design and want to print it on my t-shirt business.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Love Quote Necklace",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited September 24, 2021",
    "usage_duration": "",
    "review_text": "I love using this Print Melon app, they have great and quality items, fast customer service, and friendly user apps. Also, you can take advantage of their features when it comes to design. They have design and template available and ready to use.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "GuaranteedGoldPaydirt",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 15, 2021",
    "usage_duration": "",
    "review_text": "Great quality shirts and hoodies! The app makes it easy to upload and the detail is definitely worth writing about. I like how it can auto fulfill too!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Bigfoot Depot",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 15, 2021",
    "usage_duration": "",
    "review_text": "I used this app to help me start my dropshipping store for youtube. Print Melon got my stuff so fast! Thanks again!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "moonlahstore",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 31, 2021",
    "usage_duration": "",
    "review_text": "So much better than some of the other POD apps that I have used. Definitely have good reviews for a reason! They get my packages out on time and have a lot of different stuff! They even can engrave custom knives! It is very cool stuff!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "T-shirt Inker ",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "August 4, 2021",
    "usage_duration": "",
    "review_text": "Horrible!! In 100 orders they printed bad, printed the wrong size shirt, and printed the wrong color shirt. Their app is outdated and glitchy. These are two guys from Turkey who do everything to hide their names from you because they run this app from laptops. They are nowhere near the facility that prints for them in California. They messed up 12 out of 100 orders and then when I complained to ...",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Mindful Mama Threads",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 10, 2021",
    "usage_duration": "",
    "review_text": "I use a few different POD companies and Print Melon is by far my favorite. I do think that they could use an update on their site, it seems to be super outdated. But they have such a wide selection of products, everything so far has turned out amazing, my customers love the products and prints. Customer service is phenomenal. Pricing is the cheapest of the thre POD companies I use. Aside from the ...",
    "developer_response": "Thanks for your review and nice comments. We will definitely update our site, thanks for your suggestion. We do appreciate your business and its our pleasure to be your ...",
    "developer_response_date": "April 12, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Simply Inspired Creations",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 4, 2021",
    "usage_duration": "",
    "review_text": "I LOVE this app. I've never had a problem with customer service either! They are top notch and answer all my questions. (I ask a lot =D) They've helped in many ways of changing orders, updating orders for my customers fulfillment, and always communicate when a size is oos. They've helped my business grow a lot!!!",
    "developer_response": "Thanks for your awesome review. We are very lucky to be your fulfillment partner.",
    "developer_response_date": "April 5, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Teesrevolution.com",
    "reviewer_location": "",
    "rating": 4,
    "review_date": "Edited March 28, 2021",
    "usage_duration": "",
    "review_text": "excellent service fast shipping is awesome print and quality is Great but it can be better better than printiful and printify together Thats for sure prices need to get better sellers need to get more in return that's what we are not getting but other than that these guys are the Best",
    "developer_response": "Thanks so much. Its our pleasure to be your print on demand partner",
    "developer_response_date": "June 13, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "fitdisneychick",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 26, 2021",
    "usage_duration": "",
    "review_text": "Amazing customer service with an incredible response time! Really easy to work with and the tie-dye products are absolutely STUNNING! Will continue to work with Print Melon for many years to come!",
    "developer_response": "Thanks for your reviews. Its our pleasure to be your print on demand partner.",
    "developer_response_date": "March 26, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "GUTIVA ",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "March 16, 2021",
    "usage_duration": "",
    "review_text": "If you sell plain T-shirts from 15 to 33 .00 dollars !! how in the world can we use your services? We would have to sell them for 45 to 99 dollars?",
    "developer_response": "This is a false information. Our prices start at $6 per shirt for Gildan 5000(Print is included with the price), our Bella 3001 shirts are $9. If you are looking for Made in ...",
    "developer_response_date": "March 16, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Execute Sportswear",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 3, 2021",
    "usage_duration": "",
    "review_text": "Great clothing, Fast shipping. Never have out of stock problems. Highly recommend! Couldn't be happier!",
    "developer_response": "Thanks for your review. We appreciate your support, and so glad for being your fulfillment partner. We will always make it sure your orders are very well taken care of.",
    "developer_response_date": "March 3, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Mr Mar00n ",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited February 23, 2021",
    "usage_duration": "",
    "review_text": "how can I add a design in the left or right arm sweatshirts? really need it.. . please let me know.",
    "developer_response": "Thanks for your review, on some of the products images do look towards slightly to the left, we are aware of it, and this will not effect the print coordinates on the back ...",
    "developer_response_date": "August 9, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "ihsanaydin",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "February 17, 2021",
    "usage_duration": "",
    "review_text": "Overall, I am very satisfied with Print Melon. So for others I will mention the advantages that I experienced: First thing first, the customer service is by far the most efficient one I experienced. They replied to my questions so fast and accurately. Secondly, the shirts I ordered came with a good quality. I only use 100 percent cotton products for to keep up with the quality. Some color/size ...",
    "developer_response": "Thanks for your review. We appreciate your nice comments and your business. Our top priority is customer service and making it sure that all your requests are well taken care ...",
    "developer_response_date": "February 17, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "TRP Apparel & Gear",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited February 16, 2021",
    "usage_duration": "",
    "review_text": "Mens and womens T-shirts Mens and womens t-shirts, great quality and the printing is perfect. These guys are the best! Amazing customer service, honest, friendly and great quality products. Their shipping times are awesome too! My go to supplier and soon to be my only supplier!",
    "developer_response": "Thanks for your amazing review. We are very lucky to be your print on demand partner. Its our pleasure working with you.",
    "developer_response_date": "February 16, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "LOL KIDZ- Living Out LOUD",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited February 2, 2021",
    "usage_duration": "",
    "review_text": "I use this app for all of my T-shirts, Crew neck sweaters and hoodies. the print is great as well as the quality of the product. i'd recommend this vendor for your store.",
    "developer_response": "Thank you for your awesome review. We do appreciate your business, and it always a pleasure to be your fulfillment partner.",
    "developer_response_date": "February 2, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Fire Fit Cacao and Camping",
    "reviewer_location": "",
    "rating": 2,
    "review_date": "January 27, 2021",
    "usage_duration": "",
    "review_text": "I ordered several shirts, and was not satisfied with the quality of the print saturation or the color, and the quality of the Tie dye shirts specifically are not acceptable for my customers. Additionally I did not think that the design lab align feature was useful in any way, as each color of shirt the image would be in a different place. I selected this company because the brands to choose from ...",
    "developer_response": "Thanks for your constructive review. The tie dye shirts we use are all well known brands, and unfortunately that's all we have at the moment. It's very hard to print on Tie ...",
    "developer_response_date": "January 27, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Merch For Mutts",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "January 14, 2021",
    "usage_duration": "",
    "review_text": "DO NOT USE THIS APP! We have ran into so many issues with this company. They have screwed up nearly every order and will not fix it. We have also received unauthorized charges which our bank is dealing with. We recently switched to a company called \"SPOD\" and we could not recommend them more. Their app is so much easier to navigate, and the prints are of extremely high quality. We have been ...",
    "developer_response": "Hi, We tried our best to satisfy all of your request. We did not screwed you, as far as we know you tried to charge back every single order you placed with us. We gave you 20 ...",
    "developer_response_date": "January 15, 2021"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "ThePoliticalWarRoomStore.com",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "December 21, 2020",
    "usage_duration": "",
    "review_text": "One of the easiest provider sites to navigate and order from. They deliver quickly and my clients have been delighted by the results. Highly recommend this app out of many providers as one of the best I have worked with. Thanks!",
    "developer_response": "Thanks for your review. We do appreciate your business and its out pleasure to be your fulfillment partner.",
    "developer_response_date": "December 21, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "G-5Flame.com",
    "reviewer_location": "",
    "rating": 3,
    "review_date": "Edited October 30, 2020",
    "usage_duration": "",
    "review_text": "I've been using Print Melon for our new business for about 2 months now and just encountered the same issue as stated in some of the previous reviews. I have customers who recently ordered stating that their shirts don't fit because the style of my items were changed without notice. I also had one customer receive the incorrect color. I'm hoping this is not what we have to look forward to in ...",
    "developer_response": "Hello, Sorry that you had bad experiences. We do have size charts for our items, and they are all available underneath them. You can easily put our size charts to your ...",
    "developer_response_date": "October 30, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "SYLA",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "October 29, 2020",
    "usage_duration": "",
    "review_text": "Shipping costs are ridiculous. Keep in mind they are inflating the cost to ship significantly. This means they are profiting off the shipping and leaving you with thinner margins. $30 to ship a few hoodies and a shirt? They are using poly bags first class mail which means you get the items slower AND the true cost was probably around half charged.",
    "developer_response": "Thanks for your review. Actually our shipping costs are fixed, we don't charge $30 to ship a hoodie. We charge $8 plus $4 each additional hoodie, yet we don't ship hoodies by ...",
    "developer_response_date": "October 29, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Rescue The Republic",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited October 14, 2020",
    "usage_duration": "",
    "review_text": "Print Melon has excellent standards. We selected PM from several companies we tested when we launched. To this day, PM has provided great service. They ship on or ahead of stated turnaround time, they're highly responsive, and deliver high quality printed products.",
    "developer_response": "Thanks for your review. Its our pleasure to be your fulfillment partner. New categories are coming soon.",
    "developer_response_date": "October 15, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Ruffled Edge",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "October 7, 2020",
    "usage_duration": "",
    "review_text": "I am giving 5 stars!! No question! There were some issues with sizing not matching up in the beginning when I started using them, although the issue seemed to be on my end (I never could figure out what was going on), PM was quick to answer and quick to correct the problem. This did not happen once, but twice, and both times they were there to make it right, and from my understanding, this was a ...",
    "developer_response": "Thanks so much for your great review. Customer service is our top priority, our job is to make it sure we fulfill exactly what you need. Its really important to us that we ...",
    "developer_response_date": "October 8, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "VinLoft & AniQ M",
    "reviewer_location": "",
    "rating": 3,
    "review_date": "October 5, 2020",
    "usage_duration": "",
    "review_text": "If you have a physical store location where customers can visit to purchase your items, this is the app. But if you have an online drop shipping store and you value your customers, this will definitely not work. I have to be honest. I created designs and ordered a hoodie and a few T-Shirts. While the print quality is good, the clothing is placed in a shipping box as is. A shipping bag would be ...",
    "developer_response": "Hello, Thanks so much for your constructive review and nice comments for the print quality. Unfortunately we don't offer such service where we individually put each shirt in ...",
    "developer_response_date": "October 5, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Word On The T!",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 28, 2020",
    "usage_duration": "",
    "review_text": "This is my go to POD app! Love all of my products thus far. I make my own sublimation shirts but for colored/dark shirts I use PrintMelon and I have no complaints!",
    "developer_response": "Hi, Thanks so much for your review. We appreciate your business.",
    "developer_response_date": "September 29, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "The Scarlet Wagon Boutique",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 19, 2020",
    "usage_duration": "",
    "review_text": "Print Melon is awesome-sauce! I've been searching for a POD service for over a year, but after ordering samples from several I was extremely disappointed with either the print quality or the consistency between the prints. I found one other company with decent print quality, but their choices of shirt colors and styles was very limited. Print Melon has been amazing! Their prints are outstanding ...",
    "developer_response": "Hello, Thanks for your review. We are very glad you are happy with our services. Its our pleasure to be your fulfillment partner.",
    "developer_response_date": "September 20, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Jeep County",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited September 10, 2020",
    "usage_duration": "",
    "review_text": "By far you have the best catalog and prices from all over the print-on-demand world. quality top notch. OUSTANDING update 10.09.2020 support team 5 stars. quick response. I am all yours.",
    "developer_response": "Thanks for your constructive review and nice comments. Our international shipping is little high and we are working on it. The good thing for our international shipment is, ...",
    "developer_response_date": "September 9, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Darlin' Soul",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 3, 2020",
    "usage_duration": "",
    "review_text": "These folks are amazing. I had tried a few orders with them, when their app was in beta phase. Impressive! As life would have it, our store launch was delayed for quite some time. Launched exactly one week ago and all orders have been shipped already. Customer service is very responsive, and what really stands out is their openness to suggestions. We've suggested a few app features, and their ...",
    "developer_response": "Thanks for your awesome review. We are glad you are happy with our service. Its our pleasure to be your fulfillment partner.",
    "developer_response_date": "September 3, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "The Potters Boards",
    "reviewer_location": "",
    "rating": 4,
    "review_date": "Edited September 1, 2020",
    "usage_duration": "",
    "review_text": "Ultimately I would recommend Print Melon. 4.5/5 on apparel options and pricing, customer service 4/5 on delivery times, print quality, domestic shipping price 3.5/5 on app, and branding options 2.5/5 international shipping cost, non-apparel accessories, other perks",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Zany Birds",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited August 25, 2020",
    "usage_duration": "",
    "review_text": "Print Melon got my attention with their wide selection of quality products, like the Comfort Colors brand, as well as very fair pricing. However, three distinct things made them stand out as winners for me to work with. First was their responsive customer service. I've never waited more than several hours for a response and they are easy to talk to...just like real people! Second was that, even ...",
    "developer_response": "Thanks for your review. We love working with you and making sure your orders are processed within timely manner without any errors. We appreciate your support.",
    "developer_response_date": "August 26, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Lulu Games",
    "reviewer_location": "",
    "rating": 2,
    "review_date": "August 24, 2020",
    "usage_duration": "",
    "review_text": "In the end we had to find a different service. While the pricing with Print Melon is very favorable the quality of the print service was inconsistent at best. The saturation levels on the same shirt in various sizes had wide swings of shade, no two shirts were the same. Additionally there were some sizes in the order that were replaced with different brands. (whether better quality as they stated ...",
    "developer_response": "Thanks for your review. We apologize for the issues you have had. We tried our best to accommodate your requests. You stated you had bad prints on 3 of your shirts out of 60, ...",
    "developer_response_date": "August 24, 2020"
  },
  {
    "app_name": "Print Melon ‑ Print on Demand",
    "app_slug": "print-melon",
    "reviewer_name": "Jarius Sanford Enterprise",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 23, 2020",
    "usage_duration": "",
    "review_text": "Print Melon has been amazing serving my clients from rookies to high profile. Their customer service is nothing short of excellent. Their work ethic is amazing. They have made my job as an eCommerce manager and marketer smooth and easy. All my clients have had nothing but stellar reviews. Even through problem we have faced they have found realistic solutions to resolving each issue. The best team ...",
    "developer_response": "Thanks so much for your awesome review. Its our pleasure to serve you and making sure your clients orders are well taken care of.",
    "developer_response_date": "August 24, 2020"
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Kingsly London",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "December 15, 2025",
    "usage_duration": "",
    "review_text": "Would give 0 if I could. Very bad customer service, they want you to deposit money and than they disappear. Poor experience, DON'T USE IT!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Guajira Kings",
    "reviewer_location": "",
    "rating": 3,
    "review_date": "Edited September 26, 2025",
    "usage_duration": "",
    "review_text": "Unfortunately I had a poor business experience. First, I was quoted one price, but after funding my account to place orders, I was unexpectedly hit with a much higher price. Since the platform wouldn’t refund my money, I had no choice but to take the loss.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Yamete Shop",
    "reviewer_location": "",
    "rating": 2,
    "review_date": "January 23, 2026",
    "usage_duration": "",
    "review_text": "Muy caro, consiguen los productos que vendo muy caros, los consigo mas baratos con todo y envio en aliexpress, no veo porque usarlos a ellos.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "staylip",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 28, 2025",
    "usage_duration": "",
    "review_text": "Super easy to set up! Within minutes, I had my products synced and inventory under control. Best part is the worry-free logistics, I don’t even think about shipping anymore.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Haven Glow",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 29, 2025",
    "usage_duration": "",
    "review_text": "Ship To The Moon has completely changed the way I run my store. Orders are processed quickly, customers get their packages faster, and I don’t have to worry about inventory issues anymore. It’s reliable, affordable, and stress-free.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "SnapPick Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 23, 2025",
    "usage_duration": "",
    "review_text": "As a print-on-demand store, we needed speed and flexibility. Ship To The Moon handles both like a pro. Upload designs, get them printed, and shipped—no delays, no stress. Our customers LOVE the quality too!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Shop Urban",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 19, 2025",
    "usage_duration": "",
    "review_text": "I ship to 5 countries and STTM handles it all smoothly. My global customers are finally happy!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Nexa Mart",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 19, 2025",
    "usage_duration": "",
    "review_text": "Ship To The Moon has been a lifesaver for my store. Late deliveries are now a thing of the past, and my customers are consistently happy with their orders.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "MegaMingle",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 19, 2025",
    "usage_duration": "",
    "review_text": "The quality of products I get from STTM is always consistent, and the shipping is super quick. Their custom packaging service has helped make my brand look more professional.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "EssaBar Landscape",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 4, 2025",
    "usage_duration": "",
    "review_text": "Game-changer for my eCommerce business! I’ve scaled up globally without worrying about warehousing or shipping delays. The inventory management tools are on point!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Emy's Kitchen",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 28, 2025",
    "usage_duration": "",
    "review_text": "STTM has completely transformed our shipping game! The integration was smooth, and now we can offer faster delivery with live tracking — customers love it! Highly recommend for scaling stores.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "My Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 16, 2025",
    "usage_duration": "",
    "review_text": "This app is truly a game-changer for anyone involved in eCommerce. It offers reliable sourcing, smooth logistics, and excellent inventory management — all in one place. The service is fast, efficient, and helps reduce costs while maintaining high quality. The user interface is simple to navigate, and the overall experience is seamless. Highly recommended for businesses looking to scale with ease ...",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "ArmorLid",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 10, 2025",
    "usage_duration": "",
    "review_text": "STTM made our fulfillment process super smooth. Orders ship fast, tracking is clear, and we never worry about delays anymore. A must-have!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "My Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 1, 2025",
    "usage_duration": "",
    "review_text": "I’m new to dropshipping, but STTM made it super easy to get started. The app integrates smoothly with my store, and their customer service is outstanding. They helped me with sourcing and even branding. Highly recommend!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "JeanHaus",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 21, 2025",
    "usage_duration": "",
    "review_text": "Their product suggestions actually convert! I added three winning items they recommended, and they’re now my top sellers.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Hidden Grove",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "June 18, 2025",
    "usage_duration": "",
    "review_text": "This app helped us scale globally without adding more costs. The global warehouse integration is a huge win.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Lush Boom",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "June 17, 2025",
    "usage_duration": "",
    "review_text": "Ship To The Moon took all the stress out of sourcing and shipping. Our logistics are smoother than ever, and we’re saving on every order!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Sleek Trove",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 26, 2025",
    "usage_duration": "",
    "review_text": "I love how Ship To The Moon handles everything from product sourcing to order fulfillment. Their platform is intuitive, and the ability to customize products is a great addition. We've seen a noticeable increase in customer satisfaction and repeat purchases since we started using their services!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Proof CV",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 13, 2025",
    "usage_duration": "",
    "review_text": "What I love about Ship To The Moon is how it combines sourcing, inventory management, and fulfillment into one powerful tool. I used to juggle 3–4 apps to manage everything — now I just use STTM. Their product recommendations are data-driven and actually convert well. If you run a Shopify store, this is a must-have app.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "East West Goods",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 24, 2025",
    "usage_duration": "",
    "review_text": "Great for startups! I launched with zero logistics experience, and they handled everything behind the scenes. My store now runs like a pro operation.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "American Varieties",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 27, 2025",
    "usage_duration": "",
    "review_text": "Our fulfillment process used to be a nightmare, but Ship To The Moon has simplified everything. The logistics are smooth, inventory stays in check, and the cost savings are impressive. Their POD service allows us to personalize products, making our brand stand out. Fantastic service!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Nexa Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 22, 2025",
    "usage_duration": "",
    "review_text": "Ship To The Moon has been a game changer for our business! The seamless integration with global warehouses has significantly cut down our shipping times. The inventory management is top-notch — no more stockouts or overselling! We love how easy it is to source high-quality products and customize them for our brand. Highly recommend for anyone looking to streamline their fulfillment process!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Off Market",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 7, 2025",
    "usage_duration": "",
    "review_text": "From sourcing to fulfillment, Ship To The Moon handles everything professionally. They offer real-time inventory updates, and their customer service is top-notch. My business runs smoother than ever!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "ClearView",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 6, 2025",
    "usage_duration": "",
    "review_text": "I love the POD and branding options. Ship To The Moon helped me create custom packaging that makes my store feel premium. This has boosted my brand loyalty.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Last End Shop",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 5, 2025",
    "usage_duration": "",
    "review_text": "I’ve tried several fulfillment services, but none compare to Ship To The Moon. Their seamless integration, inventory management, and global fulfillment network make everything effortless. Highly recommended!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Everyday Nest",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 28, 2025",
    "usage_duration": "",
    "review_text": "I’ve tried many services before, but none compare. Their logistics are smooth, products are high-quality, and my customers are happy. Thanks for helping me grow my brand!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "My Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 15, 2025",
    "usage_duration": "",
    "review_text": "STTM made setting up my print-on-demand products so simple. The integration with my Shopify store was smooth, and the shipping from their global warehouses is faster than anything I’ve used before. My customers in the US and Europe are getting orders on time, and I’m seeing fewer complaints. Highly recommend for anyone serious about scaling.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Prime Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 9, 2025",
    "usage_duration": "",
    "review_text": "We tested 4 apps before landing on this one—and wow, it delivers! Reliable suppliers, fast shipping, and great packaging. Our return rate dropped and customer satisfaction is way up. Don’t sleep on this app!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Next Gen Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 16, 2025",
    "usage_duration": "",
    "review_text": "The print-on-demand service is amazing! The quality is excellent, and the process is fully automated. My brand has grown so much since using Ship To The Moon.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Vintage Online",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 4, 2025",
    "usage_duration": "",
    "review_text": "The quality of products is excellent, and their sourcing team always finds the best options at competitive prices. Plus, their shipping is fast and reliable—no more lost packages or delays!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Opulent Mart",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 16, 2025",
    "usage_duration": "",
    "review_text": "I sell globally, and finding a fulfillment partner that ships quickly and affordably was tough. But Ship To The Moon solved all my problems! Their global warehouse network ensures my customers get their orders fast.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Happy Hive",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 23, 2025",
    "usage_duration": "",
    "review_text": "I was surprised at how good the product recommendation engine is. It helped me discover best-sellers I wouldn’t have found on my own!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Maxima Clothing",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 4, 2025",
    "usage_duration": "",
    "review_text": "I was struggling with slow shipping and unreliable suppliers until I found Ship To The Moon. Now, my products are always in stock, and deliveries are smooth and on time. This service has completely changed my business for the better!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Click Shop",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 29, 2024",
    "usage_duration": "",
    "review_text": "We’ve saved so much on overhead while maintaining quality. Their logistics and sourcing are the best in the business. Plus, their inventory management tools are super user-friendly!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Nest Vivid",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 11, 2025",
    "usage_duration": "",
    "review_text": "Trust me, I've tested many apps, and Ship To The Moon is by far the best. Sourcing is quick, and the pricing is great. No more headaches with unreliable suppliers!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Auto Zen Solutions",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 29, 2024",
    "usage_duration": "",
    "review_text": "A must-have app for any e-commerce store! Their product recommendations have boosted our sales, and we’re impressed by their efficiency in handling logistics.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Universal Haven",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 8, 2025",
    "usage_duration": "",
    "review_text": "Before Ship To The Moon, fulfillment was a daily struggle. Now? Orders are smooth, stock is always updated, and our shipping speed has doubled. It’s like having a full operations team in one app!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "StyleHive Trend ",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 28, 2024",
    "usage_duration": "",
    "review_text": "Ship To The Moon has simplified our entire distribution strategy. We never have to worry about out-of-stock issues, and shipping is lightning fast!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Cotton Cuddles",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 20, 2025",
    "usage_duration": "",
    "review_text": "I was struggling with delayed orders and inconsistent suppliers until I found STTM. The sourcing is top-notch, and shipping is much faster now. Plus, the customer support is super responsive. Highly recommend!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Homely Goods",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 4, 2025",
    "usage_duration": "",
    "review_text": "I was amazed at the quality of the products I sourced. Shipping times are impressive too — my customers often leave positive feedback because of it!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "good for mobility or lifestyle",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 4, 2025",
    "usage_duration": "",
    "review_text": "The POD customization is top-notch! Our designs were produced exactly how we wanted, and fulfillment was seamless. Great for scaling print-on-demand businesses.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Shops Loom",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 20, 2025",
    "usage_duration": "",
    "review_text": "I sent them a product picture, and they found it with good quality and lower price. Amazing.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "The Athletic Side Of Us- TASOU",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 13, 2025",
    "usage_duration": "",
    "review_text": "What I love most about Ship To The Moon is how stress-free it makes my business. Their warehouse integration and inventory management have eliminated delays, and I never have to worry about stock issues. This is a must-have app!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Willow & Bloom Coffee",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 16, 2025",
    "usage_duration": "",
    "review_text": "Their sourcing and fulfillment services are top-notch! I no longer worry about inventory issues, and my customers love the fast shipping.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Woodie Hub ",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 19, 2025",
    "usage_duration": "",
    "review_text": "They truly offer low-cost fulfillment without cutting corners. Everything arrives on time and in great condition. Best sourcing partner I've worked with!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "wishy-mart",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 19, 2025",
    "usage_duration": "",
    "review_text": "Game changer for our dropshipping business! ‘Ship To The Moon’ helped us cut logistics costs while improving delivery times. Seamless integration with our Shopify store and great support team!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Zayllo",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 20, 2025",
    "usage_duration": "",
    "review_text": "The global warehouse integration is a huge plus. Our customers in the US and EU now get their orders faster, and we didn’t have to raise prices. That’s a win!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "UK Mart",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "April 19, 2025",
    "usage_duration": "",
    "review_text": "Ship To The Moon has made my dropshipping business so much easier! Orders are processed quickly, and shipping is always on time. My customers love the fast delivery!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Lil Aryenne",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "January 28, 2022",
    "usage_duration": "",
    "review_text": "Absolutely love working with them! If you hold inventory, the packages are sent within a day. They have in-house IT team that sorts all problems and request very fast. Good prices and excellent support team",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "WOWLANA",
    "reviewer_location": "",
    "rating": 2,
    "review_date": "July 1, 2025",
    "usage_duration": "",
    "review_text": "Promising start, but critical bugs make the app unusable",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "WESTGOODIES ",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 31, 2021",
    "usage_duration": "",
    "review_text": "a very good app with a good communication they give you the best prices ever with a very fast shipping happy to work with them",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Hairmax",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 5, 2025",
    "usage_duration": "",
    "review_text": "STTM helped me scale my business with branded packaging and private sourcing—game changer for serious sellers.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "PILOT OUTDOORS®",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 18, 2025",
    "usage_duration": "",
    "review_text": "Their customized POD service is a game-changer! The quality is excellent, and their shipping is fast and reliable. I can focus on growing my business without worrying about logistics.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "SA Musk",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 29, 2025",
    "usage_duration": "",
    "review_text": "I was struggling with high fulfillment costs until I found Ship To The Moon. They help me source quality products at the best prices, keeping my profit margins high. Highly recommended!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Deal N Drop",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 19, 2025",
    "usage_duration": "",
    "review_text": "Ship To The Moon helped me scale internationally. Their warehouse integrations meant I could ship closer to my customers, faster and cheaper.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Bold Bazzar",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "December 7, 2024",
    "usage_duration": "",
    "review_text": "This app has made running my store so much easier. The customized POD options allow me to offer unique products, and their logistics system ensures on-time delivery. A 5-star service for sure!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "The Black Seen",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 18, 2025",
    "usage_duration": "",
    "review_text": "Ship To The Moon has completely transformed our fulfillment process. Their seamless sourcing and logistics have helped us reduce costs while maintaining top-notch quality. Highly recommended!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Modix USA",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 8, 2025",
    "usage_duration": "",
    "review_text": "What I love most is their global warehouse system. Shipping to the US and Europe is super fast. I had one small glitch, but their support team fixed it within 24 hours. Overall, a smooth and reliable experience.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Need & Luxury",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 30, 2025",
    "usage_duration": "",
    "review_text": "I love how Ship To The Moon handles everything from product sourcing to order fulfillment. Their platform is intuitive, and the ability to customize products is a great addition. We've seen a noticeable increase in customer satisfaction and repeat purchases since we started using their services!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "My Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 30, 2025",
    "usage_duration": "",
    "review_text": "Their recommendation engine is smart. It suggests the right products to my customers and has actually helped increase my average order value",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "luxyeon",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 5, 2025",
    "usage_duration": "",
    "review_text": "The customer service is fantastic! They helped me find winning products and even offered branding options for my store. The products are of high quality, and my customers are satisfied. I highly recommend this app to any serious dropshipper!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Silky Shades | Health & Beauty Products for Everyone",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 14, 2025",
    "usage_duration": "",
    "review_text": "Finally found an app that combines POD and global logistics under one roof. The inventory management features are top-notch and helped us avoid overselling.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Zayrah Tech",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 27, 2025",
    "usage_duration": "",
    "review_text": "This app streamlined my entire fulfillment process. The sourcing options are top-notch, and shipping is fast—even international orders arrive on time. Highly recommended!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "ghani collection",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 14, 2025",
    "usage_duration": "",
    "review_text": "Being able to fulfill from Europe and the US saved me time and money. Big win!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Everyday Essence",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 12, 2025",
    "usage_duration": "",
    "review_text": "I've tried multiple fulfillment apps, but Ship To The Moon is by far the most reliable. Their sourcing is top-notch — they helped me find high-quality products I couldn't locate anywhere else. Orders ship faster, my returns have gone down, and the support team is super responsive. Total game-changer for my dropshipping store.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Souk-Cart ",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "March 3, 2025",
    "usage_duration": "",
    "review_text": "I love how easy it is to source products and fulfill orders. My customers are happy, and so am I!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "The BRAND MAKER",
    "reviewer_location": "",
    "rating": 4,
    "review_date": "December 27, 2025",
    "usage_duration": "",
    "review_text": "",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Hyper Hive",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 20, 2025",
    "usage_duration": "",
    "review_text": "STTM is the best decision I’ve made for my store. They handle everything from product sourcing to global shipping, and the results speak for themselves. My business is finally growing without stress.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "UrbanSnap",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 16, 2025",
    "usage_duration": "",
    "review_text": "The name says it all — they really ship like they’re going to the moon! Fast, professional, and dependable service every time",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Furtina",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 8, 2025",
    "usage_duration": "",
    "review_text": "Ship To The Moon has completely changed the way I run my store. Orders are processed quickly, customers get their packages faster, and I don’t have to worry about inventory issues anymore. It’s reliable, affordable, and stress-free.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Cozaire",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 5, 2025",
    "usage_duration": "",
    "review_text": "STTM helped me scale to 6-figures by cutting shipping delays and handling my inventory across multiple warehouses. Don’t sleep on this app.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Jacklin",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 4, 2025",
    "usage_duration": "",
    "review_text": "Compared to other fulfillment partners I’ve tried, STTM is the most reliable. My products arrive on time and in great condition. Highly impressed.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Hatagi",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 4, 2025",
    "usage_duration": "",
    "review_text": "I needed a reliable partner to scale my store without sacrificing quality—STTM delivered. I’ve launched 3 successful collections using their sourcing service.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "cjauna1",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 27, 2025",
    "usage_duration": "",
    "review_text": "STTM made it super easy to launch and manage my custom print-on-demand products. The product quality is excellent, and the customer service is very responsive.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "A Custom Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 27, 2025",
    "usage_duration": "",
    "review_text": "Automated tracking, inventory sync, and order routing — it’s everything I needed in one place.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "naxacart",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 27, 2025",
    "usage_duration": "",
    "review_text": "Shipping is super fast. I’ve tested many platforms, but none matched this level of reliability.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "SNAP&SMILE",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 26, 2025",
    "usage_duration": "",
    "review_text": "Automated tracking, inventory sync, and order routing — it’s everything I needed in one place.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Wavex",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 24, 2025",
    "usage_duration": "",
    "review_text": "Automated tracking, inventory sync, and order routing — it’s everything I needed in one place.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Puffer Dogs",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited July 24, 2025",
    "usage_duration": "",
    "review_text": "Awesome communication and quick services. Well recommended! Thank you Celine and STTM I look forward to working more with you in the future",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Modish Isles",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 24, 2025",
    "usage_duration": "",
    "review_text": "Simplify your fulfillment with Ship To The Moon! We offer high-quality product sourcing, fast global shipping, and smart inventory management—all in one app. Connected with global warehouses, we help reduce costs and improve delivery speed. Scale your store without increasing overhead. POD & custom products supported!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Regal Ticks",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 23, 2025",
    "usage_duration": "",
    "review_text": "Just launched my first store, and STTM made fulfillment stress-free. Orders are shipped fast, and tracking is transparent.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Luna Belle",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 23, 2025",
    "usage_duration": "",
    "review_text": "The app UI is clean and simple. I was up and running within minutes. Perfect for beginners and pros.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Chris Tees",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 21, 2025",
    "usage_duration": "",
    "review_text": "Fulfillment is always smooth, even during high-demand seasons. That’s rare with most apps.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Creativity Haven",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 20, 2025",
    "usage_duration": "",
    "review_text": "Automated tracking, inventory sync, and order routing — it’s everything I needed in one place.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "mashapk",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 20, 2025",
    "usage_duration": "",
    "review_text": "Being able to fulfill from Europe and the US saved me time and money. Big win!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Nest Nimble",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 19, 2025",
    "usage_duration": "",
    "review_text": "I sent them a product photo, and they found it with better quality and lower price. Amazing.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Jewzle ",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "Edited July 18, 2025",
    "usage_duration": "",
    "review_text": "STTM made fulfillment effortless. Orders are shipped faster and more accurately than ever!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Laheera",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 18, 2025",
    "usage_duration": "",
    "review_text": "Setup was done in minutes. Everything works flawlessly with Shopify. Highly recommend!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Lebaan",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 17, 2025",
    "usage_duration": "",
    "review_text": "STTM made fulfillment effortless. Orders are shipped faster and more accurately than ever!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "urbanhavean",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 16, 2025",
    "usage_duration": "",
    "review_text": "Setup was done in minutes. Everything works flawlessly with Shopify. Highly recommend!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Beautify Pets",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 12, 2025",
    "usage_duration": "",
    "review_text": "The best sourcing support out there.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Homfity",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 11, 2025",
    "usage_duration": "",
    "review_text": "STTM made fulfillment effortless. Orders are shipped faster and more accurately than ever!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "VIPFraming",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 9, 2025",
    "usage_duration": "",
    "review_text": "STTM handles everything. It's our all-in-one solution and we couldn’t operate without it.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Akashop",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 8, 2025",
    "usage_duration": "",
    "review_text": "Amazing Support",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "HomeMingle",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 8, 2025",
    "usage_duration": "",
    "review_text": "STTM is a lifesaver! Their team helped me find winning products and manage my inventory without any headaches. Great service and easy integration.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "ZariaPK",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 7, 2025",
    "usage_duration": "",
    "review_text": "STTM handles everything. It's our all-in-one solution and we couldn’t operate without it.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "SMARTPAN",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 7, 2025",
    "usage_duration": "",
    "review_text": "Excellent for custom Products",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "My Store",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 7, 2025",
    "usage_duration": "",
    "review_text": "STTM delivers on time, every time. Our customers are happier, and we get fewer support tickets. Love the speed!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Trop Con",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 7, 2025",
    "usage_duration": "",
    "review_text": "If you do print-on-demand, use STTM. Print quality, delivery times, and customer service are all excellent.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Loomverse",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 6, 2025",
    "usage_duration": "",
    "review_text": "Excellent for custom product fulfillment. No delays and great print quality!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Moonlit Cart",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "Edited July 6, 2025",
    "usage_duration": "",
    "review_text": "App",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "UAE Express",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 2, 2025",
    "usage_duration": "",
    "review_text": "No more overselling or stockouts. The system updates in real-time.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Mystic Loft",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 1, 2025",
    "usage_duration": "",
    "review_text": "Fast,Efficient,Easy",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Musk Al Arab ",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 1, 2025",
    "usage_duration": "",
    "review_text": "One-Stop Fulfillment",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Sahlat Souq",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 1, 2025",
    "usage_duration": "",
    "review_text": "It is very easy compared to other dropshipping apps",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Luxury products",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "June 29, 2025",
    "usage_duration": "",
    "review_text": "Super easy to use",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Pure Path",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "June 23, 2025",
    "usage_duration": "",
    "review_text": "Game changer!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Frosty Edge ",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "June 22, 2025",
    "usage_duration": "",
    "review_text": "Fast Fulfillment",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Kids Journey",
    "reviewer_location": "",
    "rating": 2,
    "review_date": "Edited June 21, 2025",
    "usage_duration": "",
    "review_text": "The lowest price I got for my product, BUT sometimes when you pay cheap prices, you get a cheap service. Only the salesperson answers messages, the support/shipping people don't. You guys had me as a new client, I told you I wanted to try your services, and out of the first 4 orders, 3 orders are a failure ‍. Currently, 16-17 days since the clients ordered and they have yet to receive it.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Radiant Charm",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "June 19, 2025",
    "usage_duration": "",
    "review_text": "The logistics dashboard is super intuitive. We can monitor everything in real-time. Amazing app!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Shop flux",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "June 15, 2025",
    "usage_duration": "",
    "review_text": "Great Customer service!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Glimmer Path",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "June 15, 2025",
    "usage_duration": "",
    "review_text": "Game Changer for Fulfillment!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Trendora",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 31, 2025",
    "usage_duration": "",
    "review_text": "Game-Changer for my Business!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Aidan Shop ",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 24, 2025",
    "usage_duration": "",
    "review_text": "Their product recommendation engine actually works! We added their suggestions to our store and saw a noticeable increase in conversions.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Luxe Groove",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 24, 2025",
    "usage_duration": "",
    "review_text": "Lower your costs, not your quality. With smart sourcing and efficient shipping, STTM powers smooth global fulfillment.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "STTM: Dropshipping & Sourcing",
    "app_slug": "ship-to-the-moon",
    "reviewer_name": "Ravup Outfits",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 24, 2025",
    "usage_duration": "",
    "review_text": "Their fulfillment is top-notch and POD options are very customizable. My brand feels premium now — thank you, Ship To The Moon!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Printseekers: Print on Demand",
    "app_slug": "printseekers",
    "reviewer_name": "Vaira Viksne",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "June 16, 2025",
    "usage_duration": "",
    "review_text": "This POD app has made my production process so much easier by simplifying the workflow. The print quality is great, and the integration with Shopify was smooth and hassle-free. Customer support is very responsive and helpful!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Printseekers: Print on Demand",
    "app_slug": "printseekers",
    "reviewer_name": "TheSuccessCity",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 23, 2025",
    "usage_duration": "",
    "review_text": "This app made setting up wall art on my store a breeze. I really like the variety of frame styles and sizes because it makes it simple to offer more choices to my customers. Everything works smoothly!",
    "developer_response": "Thank you so much for the kind words! 😊 We're really glad you're enjoying the app and the product options.",
    "developer_response_date": "May 27, 2025"
  },
  {
    "app_name": "Printseekers: Print on Demand",
    "app_slug": "printseekers",
    "reviewer_name": "Manatapete",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 28, 2025",
    "usage_duration": "",
    "review_text": "Switching from my old POD provider to Printseekers was super smooth. The app was easy to set up and the custom sizing options give me a lot more flexibility for my store!",
    "developer_response": "Thanks for the great feedback! We're glad the switch was smooth and that the custom sizing is helping your store grow 📈",
    "developer_response_date": "June 2, 2025"
  },
  {
    "app_name": "Printseekers: Print on Demand",
    "app_slug": "printseekers",
    "reviewer_name": "DeccoPrint",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "May 26, 2025",
    "usage_duration": "",
    "review_text": "I had a few questions when I was getting started and the support team was really helpful. They explained everything clearly. The wallpaper quality is also really nice—looks great and feels premium.",
    "developer_response": "We really appreciate the feedback! Glad the team was helpful and that you’re happy with the wallpapers! ❤️",
    "developer_response_date": "May 28, 2025"
  },
  {
    "app_name": "Printseekers: Print on Demand",
    "app_slug": "printseekers",
    "reviewer_name": "Danlavore",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "June 9, 2025",
    "usage_duration": "",
    "review_text": "The app has been great so far! Super easy to use and everything works just like it should.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "Printseekers: Print on Demand",
    "app_slug": "printseekers",
    "reviewer_name": "PRINTTOO",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "June 2, 2025",
    "usage_duration": "",
    "review_text": "Super easy to use and the prices are really good. Happy with how it’s going!",
    "developer_response": "Thank you! We're happy to hear you're enjoying the app and the pricing works well for you!",
    "developer_response_date": "June 4, 2025"
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "wowhoo藝術家",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "November 25, 2025",
    "usage_duration": "",
    "review_text": "The service was excellent and the system was stable.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "Modern Baby",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 17, 2025",
    "usage_duration": "",
    "review_text": "The AI filter effects are fantastic! I only needed a few credits to get exactly the results I wanted—it’s way more cost-effective than those monthly subscriptions on other platforms. Plus, there are so many built-in examples I can use directly. Absolutely amazing",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "Tortenbild-Druckerei",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 11, 2025",
    "usage_duration": "",
    "review_text": "Schönes Plugin, einfache Handhabung, Support erreichbar.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "AWRUFF GEAR",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "August 3, 2024",
    "usage_duration": "",
    "review_text": "The app is really well built and the UI is clean, there's even an option to add custom fonts which is incredibly useful! Would it be possible to add a colour picker (with Hex code) element to the Free plan though?",
    "developer_response": "Thank you so much! We will continue to roll out new features to address the complexities in the custom gifts space. By the way, the color swatch component will be free to use ...",
    "developer_response_date": "August 6, 2024"
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "3BROW",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 10, 2025",
    "usage_duration": "",
    "review_text": "Amazing support!",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "Ravaya",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 17, 2025",
    "usage_duration": "",
    "review_text": "I’ve tried several customization platforms, and this is the only one that meets all of my needs. Customer service is also incredibly responsive. I truly hope the platform keeps growing.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "Livestock & Co.",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "January 9, 2025",
    "usage_duration": "",
    "review_text": "Really poor experience with this company. Lacks features I needed so was promptly uninstalled. Free trial was not honored because it was the second time I had installed it for a few day trial, they are blaming it on there new subscription model but this was all done prior to that being in place. There are better options out there, PrintLane, Customily, TeeinBlue.",
    "developer_response": "Thank you for the feedback. Please let us know which features are missing, and we'll work to improve them as soon as possible. Regarding the poor experience you mentioned, ...",
    "developer_response_date": "January 12, 2025"
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "AlkoNaWesele.pl",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 15, 2025",
    "usage_duration": "",
    "review_text": "CustoMeow is incredibly useful, the features are practical, and the interface design is stunning. I only wish I had discovered it sooner.",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "NAILELF",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "February 11, 2025",
    "usage_duration": "",
    "review_text": "This is the best customization software I have ever used. It is completely suitable for customization sellers with simple and complex functional requirements. Its functions cover 99% of customization needs. The most amazing thing is its 3D preview function, which is very good. The most important thing is that its subscription price is very cost-effective compared to other software. It is worth ...",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "GIFT-GO ",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 11, 2025",
    "usage_duration": "",
    "review_text": "very nice app，it fit pod seller。",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "UNIQPOP",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "September 10, 2025",
    "usage_duration": "",
    "review_text": "good app",
    "developer_response": "",
    "developer_response_date": ""
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "Wooferface ",
    "reviewer_location": "",
    "rating": 1,
    "review_date": "August 16, 2025",
    "usage_duration": "",
    "review_text": "Struggled to install it. Keep saying Find to Add to Cart button and got stuck from there. Leaving.",
    "developer_response": "Since every store’s theme is unique, we currently rely on a Chrome extension to locate your website’s buttons. We understand this process can feel a bit complex, and we ...",
    "developer_response_date": "August 18, 2025"
  },
  {
    "app_name": "CustoMeow POD Designer",
    "app_slug": "customeow-product-personalizer",
    "reviewer_name": "LUXAVA",
    "reviewer_location": "",
    "rating": 5,
    "review_date": "July 10, 2025",
    "usage_duration": "",
    "review_text": "CustoMeow is incredibly useful, the features are practical, and the interface design is stunning. I only wish I had discovered it sooner.",
    "developer_response": "",
    "developer_response_date": ""
  }
]